sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_flash.c
/**
  ******************************************************************************
  * @file    py32f003_hal_flash.c
  * @author  MCU Application Team
  * @brief   FLASH HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the internal FLASH memory:
  *           + Program operations functions
  *           + Memory Control functions
  *           + Peripheral Errors functions
  *
 @verbatim

  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32f003_hal.h"

/** @addtogroup PY32F003_HAL_Driver
  * @{
  */

/** @defgroup FLASH FLASH
  * @brief FLASH HAL module driver
  * @{
  */

#ifdef HAL_FLASH_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup FLASH_Private_Variables FLASH Private Variables
 * @{
 */
/**
  * @brief  Variable used for Program/Erase sectors under interruption
  */
FLASH_ProcessTypeDef pFlash  = {.Lock = HAL_UNLOCKED, \
                                .ErrorCode = HAL_FLASH_ERROR_NONE, \
                                .ProcedureOnGoing = FLASH_TYPENONE, \
                                .Address = 0U, \
                                .Page = 0U, \
                                .NbPagesToErase = 0U
                               };
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup FLASH_Private_Functions FLASH Private Functions
 * @{
 */
//static  void  FLASH_Program_Word(uint32_t Address, uint32_t Data);
//static	void 	FLASH_Program(uint32_t Address, uint32_t *pdata);
static 	void 	FLASH_PageErase(uint32_t PageAddress);
static 	void 	FLASH_MassErase(void);
static  void  FLASH_Program_Page(uint32_t Address, uint32_t * DataAddress);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup FLASH_Exported_Functions FLASH Exported Functions
  * @{
  */

/** @defgroup FLASH_Exported_Functions_Group1 Programming operation functions
 *  @brief   Programming operation functions
 *
@verbatim
 ===============================================================================
                  ##### Programming operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the FLASH
    program operations.

@endverbatim
  * @{
  */

///**
//  * @brief  Program double word or fast program of a row at a specified address.
//  * @param  TypeProgram Indicate the way to program at a specified address.
//  *                      This parameter can be a value of @ref FLASH_Type_Program
//  * @param  Address Specifies the address to be programmed.
//  * @param  adr:Page Start Address
//  *         sz: Page Size (128bytes)
//  *         buf:Page Data
//  *
//  * @retval HAL_StatusTypeDef HAL Status
//  */
//HAL_StatusTypeDef HAL_FLASH_ProgramPage(unsigned long adr,unsigned long sz, unsigned char *buf)
//{
//
//
//	uint8_t *pdata,*temp_buf;
//	unsigned long start_addr,end_addr;
//  HAL_StatusTypeDef status;

//  /* Check the parameters */
//  assert_param(IS_FLASH_TYPEPROGRAM(TypeProgram));
//  assert_param(IS_FLASH_PROGRAM_ADDRESS(Address));

//  /* Process Locked */
//  __HAL_LOCK(&pFlash);

//  /* Reset error code */
//  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

//  /* Wait for last operation to be completed */
//  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

//  if (status == HAL_OK)
//  {
//		   start_addr=adr&0xffffff80;   //sz first page addr
//		   temp_buf =buf-(adr-start_addr);
//		   pdata=temp_buf;
//		   for(uint8_t i=0;i<adr-start_addr;i++)
//		   {
//				   *temp_buf++=*(__IO uint8_t *)(start_addr+i);
//
//			 }
//			 temp_buf =buf+sz;
//
//		   end_addr=(adr+sz+0x80)&0xffffff80;  //sz last page addr
//			 for(uint8_t i=0;i<end_addr;i++)
//			 {
//				  *temp_buf++=*(__IO uint8_t *)(adr+sz+i);
//			 }
//
//		   while(start_addr>end_addr)
//			 {
//				   FLASH_PageErase(start_addr);
////				   FLASH_Program_Page(start_addr, *((uint32_t *)pdata));
//				   start_addr+=0x80;
//				   pdata+=128;
//
//			 }
//
//
//

//  }

//  /* Process Unlocked */
//  __HAL_UNLOCK(&pFlash);

//  /* return status */
//  return status;
//}

/**
  * @brief  Program double word or fast program of a row at a specified address with interrupt enabled.
  * @param  TypeProgram Indicate the way to program at a specified address.
  *                      This parameter can be a value of @ref FLASH_Type_Program
  * @param  Address Specifies the address to be programmed.
  * @param  Data Specifies the data to be programmed
  *               This parameter is the data for the double word program and the address where
  *               are stored the data for the row fast program.
  *
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_Program_IT(uint32_t TypeProgram, uint32_t Address, uint64_t Data)
{
    HAL_StatusTypeDef status;

//  /* Check the parameters */
//  assert_param(IS_FLASH_TYPEPROGRAM(TypeProgram));
//  assert_param(IS_FLASH_PROGRAM_ADDRESS(Address));

//  /* Process Locked */
//  __HAL_LOCK(&pFlash);

//  /* Reset error code */
//  pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

//  /* Wait for last operation to be completed */
//  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

//  if (status != HAL_OK)
//  {
//    /* Process Unlocked */
//    __HAL_UNLOCK(&pFlash);
//  }
//  else
//  {
//    /* Set internal variables used by the IRQ handler */
//    pFlash.ProcedureOnGoing = TypeProgram;
//    pFlash.Address = Address;

//    /* Enable End of Operation and Error interrupts */
//    __HAL_FLASH_ENABLE_IT(FLASH_IT_EOP | FLASH_IT_OPERR | FLASH_IT_ECCC);

//    if (TypeProgram == FLASH_TYPEPROGRAM_DOUBLEWORD)
//    {
//      /* Check the parameters */
//      assert_param(IS_FLASH_PROGRAM_ADDRESS(Address));

