sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_flash.c
//      /* Program double-word (64-bit) at a specified address */
//      FLASH_Program_DoubleWord(Address, Data);
//    }
//    else
//    {
//      /* Check the parameters */
//      assert_param(IS_FLASH_FAST_PROGRAM_ADDRESS(Address));

//      /* Fast program a 32 row double-word (64-bit) at a specified address */
//      FLASH_Program_Fast(Address, (uint32_t)Data);
//    }
//  }

//  /* return status */
    return status;
}

/**
  * @brief Handle FLASH interrupt request.
  * @retval None
  */
void HAL_FLASH_IRQHandler(void)
{
//  uint32_t param = 0xFFFFFFFFU;
//  uint32_t error;

//  /* Save flash errors. Only ECC detection can be checked here as ECCC
//     generates NMI */
//  error = (FLASH->SR & FLASH_FLAG_SR_ERROR);
//  error |= (FLASH->ECCR & FLASH_FLAG_ECCC);

//  CLEAR_BIT(FLASH->CR, pFlash.ProcedureOnGoing);

//  /* A] Set parameter for user or error callbacks */
//  /* check operation was a program or erase */
//  if ((pFlash.ProcedureOnGoing & (FLASH_TYPEPROGRAM_DOUBLEWORD | FLASH_TYPEPROGRAM_FAST)) != 0x00U)
//  {
//    /* return adress being programmed */
//    param = pFlash.Address;
//  }
//  else if ((pFlash.ProcedureOnGoing & (FLASH_TYPEERASE_MASS | FLASH_TYPEERASE_PAGES)) != 0x00U)
//  {
//    /* return page number being erased (0 for mass erase) */
//    param = pFlash.Page;
//  }
//  else
//  {
//    /* Nothing to do */
//  }

//  /* B] Check errors */
//  if (error != 0x00U)
//  {
//    /*Save the error code*/
//    pFlash.ErrorCode |= error;

//    /* clear error flags */
//    __HAL_FLASH_CLEAR_FLAG(error);

//    /*Stop the procedure ongoing*/
//    pFlash.ProcedureOnGoing = FLASH_TYPENONE;

//    /* Error callback */
//    HAL_FLASH_OperationErrorCallback(param);
//  }

//  /* C] Check FLASH End of Operation flag */
//  if (__HAL_FLASH_GET_FLAG(FLASH_FLAG_EOP) != 0x00U)
//  {
//    /* Clear FLASH End of Operation pending bit */
//    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP);

//    if (pFlash.ProcedureOnGoing == FLASH_TYPEERASE_PAGES)
//    {
//      /* Nb of pages to erased can be decreased */
//      pFlash.NbPagesToErase--;

//      /* Check if there are still pages to erase*/
//      if (pFlash.NbPagesToErase != 0x00U)
//      {
//        /* Increment page number */
//        pFlash.Page++;
//        FLASH_PageErase(pFlash.Page);
//      }
//      else
//      {
//        /* No more pages to erase: stop erase pages procedure */
//        pFlash.ProcedureOnGoing = FLASH_TYPENONE;
//      }
//    }
//    else
//    {
//      /*Stop the ongoing procedure */
//      pFlash.ProcedureOnGoing = FLASH_TYPENONE;
//    }

//    /* User callback */
//    HAL_FLASH_EndOfOperationCallback(param);
//  }

//  if (pFlash.ProcedureOnGoing == FLASH_TYPENONE)
//  {
//    /* Disable End of Operation and Error interrupts */
//    __HAL_FLASH_DISABLE_IT(FLASH_IT_EOP | FLASH_IT_OPERR | FLASH_IT_ECCC);

//    /* Process Unlocked */
//    __HAL_UNLOCK(&pFlash);
//  }
}

/**
  * @brief  FLASH end of operation interrupt callback.
  * @param  ReturnValue The value saved in this parameter depends on the ongoing procedure
  *                  Mass Erase: 0
  *                  Page Erase: Page which has been erased
  *                  Program: Address which was selected for data program
  * @retval None
  */
__weak void HAL_FLASH_EndOfOperationCallback(uint32_t ReturnValue)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(ReturnValue);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_FLASH_EndOfOperationCallback could be implemented in the user file
     */
}

/**
  * @brief  FLASH operation error interrupt callback.
  * @param  ReturnValue The value saved in this parameter depends on the ongoing procedure
  *                 Mass Erase: 0
  *                 Page Erase: Page number which returned an error
  *                 Program: Address which was selected for data program
  * @retval None
  */
__weak void HAL_FLASH_OperationErrorCallback(uint32_t ReturnValue)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(ReturnValue);

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_FLASH_OperationErrorCallback could be implemented in the user file
     */
}

/**
  * @}
  */

/** @defgroup FLASH_Exported_Functions_Group2 Peripheral Control functions
 *  @brief   Management functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the FLASH
    memory operations.

@endverbatim
  * @{
  */

/**
  * @brief  Unlock the FLASH control register access.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_Unlock(void)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (READ_BIT(FLASH->CR, FLASH_CR_LOCK) != 0x00U)
    {
        /* Authorize the FLASH Registers access */
        WRITE_REG(FLASH->KEYR, FLASH_KEY1);
        WRITE_REG(FLASH->KEYR, FLASH_KEY2);

        /* verify Flash is unlock */
        if (READ_BIT(FLASH->CR, FLASH_CR_LOCK) != 0x00U)
        {
            status = HAL_ERROR;
        }
    }

    return status;
}

/**
  * @brief  Lock the FLASH control register access.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_Lock(void)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    /* Set the LOCK Bit to lock the FLASH Registers access */
    SET_BIT(FLASH->CR, FLASH_CR_LOCK);

    /* verify Flash is locked */
    if (READ_BIT(FLASH->CR, FLASH_CR_LOCK) != 0x00u)
    {
        status = HAL_OK;
    }

    return status;
}

/**
  * @brief  Unlock the FLASH Option Bytes Registers access.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_OB_Unlock(void)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    if (READ_BIT(FLASH->CR, FLASH_CR_OPTLOCK) != 0x00U)
    {
        /* Authorizes the Option Byte register programming */
        WRITE_REG(FLASH->OPTKEYR, FLASH_OPTKEY1);
        WRITE_REG(FLASH->OPTKEYR, FLASH_OPTKEY2);

        /* verify option bytes are unlocked */
        if (READ_BIT(FLASH->CR, FLASH_CR_OPTLOCK) == 0x00U)
        {
            status = HAL_OK;
        }
    }

