sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_flash.c
    return status;
}

/**
  * @brief  Lock the FLASH Option Bytes Registers access.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_OB_Lock(void)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    /* Set the OPTLOCK Bit to lock the FLASH Option Byte Registers access */
    SET_BIT(FLASH->CR, FLASH_CR_OPTLOCK);

    /* verify option bytes are locked */
    if (READ_BIT(FLASH->CR, FLASH_CR_OPTLOCK) != 0x00u)
    {
        status = HAL_OK;
    }

    return status;
}

/**
  * @brief  Launch the option byte loading.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_FLASH_OB_Launch(void)
{
    /* Set the bit to force the option byte reloading */
    SET_BIT(FLASH->CR, FLASH_CR_OBL_LAUNCH);

    /* We should not reach here : Option byte launch generates Option byte reset
       so return error */
    return HAL_ERROR;
}

/**
  * @}
  */

/** @defgroup FLASH_Exported_Functions_Group3 Peripheral State and Errors functions
 *  @brief   Peripheral Errors functions
 *
@verbatim
 ===============================================================================
                ##### Peripheral Errors functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time Errors of the FLASH peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Get the specific FLASH error flag.
  * @retval FLASH_ErrorCode The returned value can be
  *            @arg @ref HAL_FLASH_ERROR_NONE No error set
  *            @arg @ref HAL_FLASH_ERROR_OP FLASH Operation error
  *            @arg @ref HAL_FLASH_ERROR_PROG FLASH Programming error
  *            @arg @ref HAL_FLASH_ERROR_WRP FLASH Write protection error
  *            @arg @ref HAL_FLASH_ERROR_PGA FLASH Programming alignment error
  *            @arg @ref HAL_FLASH_ERROR_SIZ FLASH Size error
  *            @arg @ref HAL_FLASH_ERROR_PGS FLASH Programming sequence error
  *            @arg @ref HAL_FLASH_ERROR_MIS FLASH Fast programming data miss error
  *            @arg @ref HAL_FLASH_ERROR_FAST FLASH Fast programming error
  *            @arg @ref HAL_FLASH_ERROR_RD FLASH Read Protection error (PCROP)(*)
  *            @arg @ref HAL_FLASH_ERROR_OPTV FLASH Option validity error
  *            @arg @ref HAL_FLASH_ERROR_ECCD FLASH two ECC errors have been detected
  * @note (*) availability depends on devices
  */
uint32_t HAL_FLASH_GetError(void)
{
    return pFlash.ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/** @addtogroup FLASH_Private_Functions
  * @{
  */

/**
  * @brief  Wait for a FLASH operation to complete.
  * @param  Timeout maximum flash operation timeout
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef FLASH_WaitForLastOperation(uint32_t Timeout)
{
//  uint32_t error;
//  uint32_t eccerr;
    /* Wait for the FLASH operation to complete by polling on BUSY flag to be reset.
       Even if the FLASH operation fails, the BUSY flag will be reset and an error
       flag will be set */
    uint32_t timeout = HAL_GetTick() + Timeout;

    /* Wait if any operation is ongoing */
    while (__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY) != 0x00U)
    {
        if (HAL_GetTick() >= timeout)
        {
            return HAL_TIMEOUT;
        }
    }

    /* check flash errors. Only ECC correction can be checked here as ECCD
        generates NMI */
//  error = (FLASH->SR & FLASH_FLAG_SR_ERROR);

    /* Clear SR register */
    FLASH->SR = FLASH_FLAG_SR_CLEAR;


    return HAL_OK;
}
/**
  * @brief  Full erase of FLASH memory Bank
  *
  * @retval None
  */
static void FLASH_MassErase(void)
{
    /* Clean the error context */
    pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;
    HAL_FLASH_Unlock();
    /* Only bank1 will be erased*/
    SET_BIT(FLASH->CR, FLASH_CR_MER);
    *(__IO uint32_t *)(0x08000000)=0x12344321;

}

static 	void 	FLASH_PageErase(uint32_t PageAddress)
{
    /* Clean the error context */
    pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;
    HAL_FLASH_Unlock();
    SET_BIT(FLASH->CR, FLASH_CR_PER);
    *(__IO uint32_t *)(PageAddress)=0xff;
    while (((FLASH->SR & FLASH_SR_BSY) != 0x00U)&&((FLASH->SR & FLASH_SR_EOP) == 0x00U))
    {
    }


}
static 	void 	FLASH_SectorErase(uint32_t SectorAddress)
{
    HAL_FLASH_Unlock();
    SET_BIT(FLASH->CR, FLASH_CR_SER);
    *(__IO uint32_t *)(SectorAddress)=0xff;
    while (((FLASH->SR & FLASH_SR_BSY) != 0x00U)&&((FLASH->SR & FLASH_SR_EOP) == 0x00U))
    {
    }
}
static __RAM_FUNC void FLASH_Program_Page(uint32_t Address, uint32_t * DataAddress)
{

    uint8_t index=0;
    uint32_t dest = Address;
    uint32_t * src = DataAddress;
    uint32_t primask_bit;



    SET_BIT(FLASH->CR, FLASH_CR_PG);
    /* Enter critical section: row programming should not be longer than 7 ms */
    primask_bit = __get_PRIMASK();
    __disable_irq();
    /* 32 words*/
    while(index<32U)
    {
        *(uint32_t *)dest = *src;
        src += 1U;
        dest += 4U;
        index++;
        if(index==31)
        {
            SET_BIT(FLASH->CR, FLASH_CR_PGSTRT);
        }
    }
    /* wait for BSY1 in order to be sure that flash operation is ended befoire
       allowing prefetch in flash. Timeout does not return status, as it will
       be anyway done later */
    while ((FLASH->SR & FLASH_SR_BSY) != 0x00U)
    {
    }

    /* Exit critical section: restore previous priority mask */
    __set_PRIMASK(primask_bit);
}
///**
//  * @brief  Program double-word (64-bit) at a specified address.
//  * @param  Address Specifies the address to be programmed.
//  * @param  Data Specifies the data to be programmed.
//  * @retval None
//  */

//static void FLASH_Program_Word(uint32_t Address, uint32_t Data)
//{
//  /* Set PG bit */
//
//  SET_BIT(FLASH->CR, FLASH_CR_PG);

//  /* Program first word */
//  *(uint32_t *)Address = (uint32_t)Data;

//  /* Barrier to ensure programming is performed in 2 steps, in right order
//    (independently of compiler optimization behavior) */
//  __ISB();
//}

/**
  * @brief  Fast program a 32 row double-word (64-bit) at a specified address.
  * @param  Address Specifies the address to be programmed.
  * @param  DataAddress Specifies the address where the data are stored.
  * @retval None
  */

/**
  * @}
  */
/**
  * @brief  Perform a mass erase or erase the specified FLASH memory pages
  * @note   To correctly run this function, the @ref HAL_FLASH_Unlock() function
  *         must be called before.
  *         Call the @ref HAL_FLASH_Lock() to disable the flash memory access
  *         (recommended to protect the FLASH memory against possible unwanted operation)
  * @param[in]  pEraseInit pointer to an FLASH_EraseInitTypeDef structure that
  *         contains the configuration information for the erasing.
  *
  * @param[out]  PageError pointer to variable  that
  *         contains the configuration information on faulty page in case of error
  *         (0xFFFFFFFF means that all the pages have been correctly erased)
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_Erase(FLASH_EraseInitTypeDef *pEraseInit, uint32_t *PageError)
{
    HAL_StatusTypeDef status = HAL_ERROR;
    uint32_t address = 0U;

    /* Process Locked */
    __HAL_LOCK(&pFlash);

    /* Check the parameters */
    assert_param(IS_FLASH_TYPEERASE(pEraseInit->TypeErase));

