sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_flash.c
    if (pEraseInit->TypeErase == FLASH_TYPEERASE_MASSERASE)
    {
        /* Mass Erase requested for Bank1 */
        /* Wait for last operation to be completed */
        if (FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE) == HAL_OK)
        {
            /*Mass erase to be done*/
            FLASH_MassErase();

            /* Wait for last operation to be completed */
            status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

            /* If the erase operation is completed, disable the MER Bit */
            HAL_FLASH_Unlock();
            CLEAR_BIT(FLASH->CR, FLASH_CR_MER);
//				HAL_FLASH_Lock();
        }
    }
    else if(pEraseInit->TypeErase == FLASH_TYPEERASE_PAGEERASE)
    {
        /* Page Erase is requested */
        /* Check the parameters */
        assert_param(IS_FLASH_PROGRAM_ADDRESS(pEraseInit->PageAddress));
        assert_param(IS_FLASH_NB_PAGES(pEraseInit->PageAddress, pEraseInit->NbPages));

        /* Page Erase requested on address located on bank1 */
        /* Wait for last operation to be completed */
        if (FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE) == HAL_OK)
        {
            /*Initialization of PageError variable*/
            *PageError = 0xFFFFFFFFU;

            /* Erase page by page to be done*/
            for(address = pEraseInit->PageAddress;
                    address < ((pEraseInit->NbPages * FLASH_PAGE_SIZE) + pEraseInit->PageAddress);
                    address += FLASH_PAGE_SIZE)
            {
                FLASH_PageErase(address);

                /* Wait for last operation to be completed */
                status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);
                HAL_FLASH_Unlock();
                /* If the erase operation is completed, disable the PER Bit */
                CLEAR_BIT(FLASH->CR, FLASH_CR_PER);
//         HAL_FLASH_Lock();
                if (status != HAL_OK)
                {
                    /* In case of error, stop erase procedure and return the faulty address */
                    *PageError = address;
                    break;
                }
            }
        }
    }
    else if(pEraseInit->TypeErase == FLASH_TYPEERASE_SECTORERASE)
    {
        if (FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE) == HAL_OK)
        {
            FLASH_SectorErase(pEraseInit->SectorAddress);
            /* Wait for last operation to be completed */
            status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

            /* If the erase operation is completed, disable the MER Bit */
            HAL_FLASH_Unlock();
            CLEAR_BIT(FLASH->CR, FLASH_CR_SER);
//				   HAL_FLASH_Lock();
        }
    }

    /* Process Unlocked */
    __HAL_UNLOCK(&pFlash);

    return status;
}

/**
  * @brief   FLASH Program and Erase Clock Config.
  * @@param  u32ClockID clock select
  *            @arg @ref FLASH_PROGRAM_ERASE_CLOCK_4MHZ
  *            @arg @ref FLASH_PROGRAM_ERASE_CLOCK_8MHZ
  *            @arg @ref FLASH_PROGRAM_ERASE_CLOCK_16MHZ
  *            @arg @ref FLASH_PROGRAM_ERASE_CLOCK_22P12MHZ
  *            @arg @ref FLASH_PROGRAM_ERASE_CLOCK_24MHZ
  * @retval  None
  */
void HAL_FLASH_Init(uint32_t u32ClockID)
{
    //flash擦写时间配置寄存器4MHz/8MHz/16MHz/22.12MHz/24MHz对应的首个寄存器地址
    const uint32_t _aTime[5] = {0x1FFF0F1C, 0x1FFF0F30, 0x1FFF0F44, 0x1FFF0F58, 0x1FFF0F6C};

    assert_param(IS_FLASH_TIMECONFIG_CLOCK(u32ClockID));

    __HAL_FLASH_TIME_REG_SET((*(uint32_t *)(_aTime[u32ClockID])),     \
                             (*(uint32_t *)(_aTime[u32ClockID]+4)),   \
                             (*(uint32_t *)(_aTime[u32ClockID]+8)),   \
                             (*(uint32_t *)(_aTime[u32ClockID]+12)),  \
                             (*(uint32_t *)(_aTime[u32ClockID]+16)));
}

HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint32_t * DataAddr )
{
    HAL_StatusTypeDef status = HAL_ERROR;
//  uint8_t index = 0U;
//  uint8_t nbiterations = 0U;

    /* Process Locked */
    __HAL_LOCK(&pFlash);

    /* Check the parameters */
    assert_param(IS_FLASH_TYPEPROGRAM(TypeProgram));
    assert_param(IS_FLASH_PROGRAM_ADDRESS(Address));

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

    if(status == HAL_OK)
    {
        HAL_FLASH_Unlock();

        FLASH_Program_Page(Address, DataAddr);


        /* Wait for last operation to be completed */
        status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);
        HAL_FLASH_Unlock();
        /* If the program operation is completed, disable the PG Bit */
        CLEAR_BIT(FLASH->CR, FLASH_CR_PG);
//		  HAL_FLASH_Lock();
        /* In case of error, stop programming procedure */
        if (status != HAL_OK)
        {
            return status;
        }

    }

    /* Process Unlocked */
    __HAL_UNLOCK(&pFlash);

    return status;
}
/**
  * @brief  Set the read protection level.
  * @param  ReadProtectLevel specifies the read protection level.
  *         This parameter can be one of the following values:
  *            @arg @ref OB_RDP_LEVEL_0 No protection
  *            @arg @ref OB_RDP_LEVEL_1 Read protection of the memory
  *
  * @note   Warning: When enabling OB_RDP level 2 it's no more possible to go back to level 1 or 0
  * @retval HAL status
  */
//static HAL_StatusTypeDef FLASH_OB_RDP_LevelConfig(uint8_t ReadProtectLevel)
//{
//    HAL_StatusTypeDef status = HAL_OK;

//    /* Check the parameters */
//    assert_param(IS_OB_RDP_LEVEL(ReadProtectLevel));

//    /* Wait for last operation to be completed */
//    status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

//    if(status == HAL_OK)
//    {
//        /* Clean the error context */
//        pFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

//        /* If the previous operation is completed, proceed to erase the option bytes */

//        HAL_FLASH_Unlock();

//        HAL_FLASH_OB_Unlock();




//        SET_BIT(FLASH->OPTR, ReadProtectLevel);

//        /* Wait for last operation to be completed */
//        status = FLASH_WaitForLastOperation((uint32_t)FLASH_TIMEOUT_VALUE);

//    }

//    return status;
//}


/**
  * @brief   Get the Option byte configuration
  * @param  pOBInit pointer to an FLASH_OBInitStruct structure that
  *         contains the configuration information for the programming.
  * 
  * @retval None
  */
void HAL_FLASHEx_OBGetConfig(FLASH_OBProgramInitTypeDef *pOBInit)
{
    pOBInit->OptionType = OPTIONBYTE_ALL;
   
    /* Get WRP sector */
    pOBInit->WRPState = OB_WRPSTATE_ENABLE;
    pOBInit->WRPSector = FLASH->WRPR;
   
    /* Get SDK sector */
    pOBInit->SDKStartAddr = (FLASH->SDKR)&0x1F;
    pOBInit->SDKEndAddr = ((FLASH->SDKR)&0x1F00)>>8;
   
    /*Get RDP Level*/
    if (((FLASH->OPTR)&0xFF) == OB_RDP_LEVEL_0)
    {
        pOBInit->RDPLevel   = OB_RDP_LEVEL_0;
    }else
    {
        pOBInit->RDPLevel   = OB_RDP_LEVEL_1;
    }    
   
    /*Get USER*/
    pOBInit->USERConfig = (FLASH->OPTR)&(FLASH_OPTR_WWDG_SW|FLASH_OPTR_IWDG_SW|FLASH_OPTR_NRST_MODE);
   
