sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_flash.c
    /*Get BOR Level*/
    pOBInit->BORLevel   = (FLASH->OPTR)&(FLASH_OPTR_BOR_EN|FLASH_OPTR_BOR_LEV);
   
    /* Get BOOT bit 1 config OB */
    pOBInit->BOOTBit1Config = (FLASH->OPTR)&(FLASH_OPTR_nBOOT1);
}

/**
  * @brief  Program option bytes
  * @note   The function @ref HAL_FLASH_Unlock() should be called before to unlock the FLASH interface
  *         The function @ref HAL_FLASH_OB_Unlock() should be called before to unlock the options bytes
  *         The function @ref HAL_FLASH_OB_Launch() should be called after to force the reload of the options bytes
  *         (system reset will occur)
  *
  * @param  pOBInit pointer to an FLASH_OBInitStruct structure that
  *         contains the configuration information for the programming.
  *
  * @retval HAL_StatusTypeDef HAL Status
  */
HAL_StatusTypeDef HAL_FLASHEx_OBProgram(FLASH_OBProgramInitTypeDef *pOBInit)
{
    HAL_StatusTypeDef status = HAL_ERROR;

    /* Process Locked */
    __HAL_LOCK(&pFlash);

    /* Check the parameters */
    assert_param(IS_OPTIONBYTE(pOBInit->OptionType));

    HAL_FLASH_Unlock();
    HAL_FLASH_OB_Unlock();
    /* Write protection configuration */
    if((pOBInit->OptionType & OPTIONBYTE_WRP) == OPTIONBYTE_WRP)
    {
        assert_param(IS_WRPSTATE(pOBInit->WRPState));
        if (pOBInit->WRPState == OB_WRPSTATE_ENABLE)
        {
            /* Enable of Write protection on the selected sector */
            FLASH->WRPR = pOBInit->WRPSector;
        }
        else
        {
            /* Disable of Write protection on the selected page */
            FLASH->WRPR = 0;
        }
    }

    /* SDK protection configuration */
    if((pOBInit->OptionType & OPTIONBYTE_SDK) == OPTIONBYTE_SDK)
    {
        assert_param(IS_SDKSTATE(pOBInit->SDKState));
        if (pOBInit->WRPState == OB_WRPSTATE_ENABLE)
        {
            /* Enable of Write protection on the selected sector */
            FLASH->SDKR = (pOBInit->SDKStartAddr) | (pOBInit->SDKEndAddr<<8);
        }
        else
        {
            /* Disable of Write protection on the selected page */
            FLASH->WRPR = 0;
        }
        
    }

    /* Read protection configuration */
    if((pOBInit->OptionType & OPTIONBYTE_RDP) == OPTIONBYTE_RDP)
    {
        MODIFY_REG(FLASH->OPTR, FLASH_OPTR_RDP, pOBInit->RDPLevel);
    }

    /* USER configuration */
    if((pOBInit->OptionType & OPTIONBYTE_USER) == OPTIONBYTE_USER)
    {
        MODIFY_REG(FLASH->OPTR, (FLASH_OPTR_IWDG_SW|FLASH_OPTR_WWDG_SW|   \
                                 FLASH_OPTR_NRST_MODE),pOBInit->USERConfig);
    }

    /* BOR configuration*/
    if((pOBInit->OptionType & OPTIONBYTE_BOR) == OPTIONBYTE_BOR)
    {
        MODIFY_REG(FLASH->OPTR, (FLASH_OPTR_BOR_EN|FLASH_OPTR_BOR_LEV), \
                                 pOBInit->BORLevel);
    }

    /* BOOTBit1 configuration*/
    if((pOBInit->OptionType & OPTIONBYTE_BOOT_BIT1) == OPTIONBYTE_BOOT_BIT1)
    {
        MODIFY_REG(FLASH->OPTR, (FLASH_OPTR_nBOOT1), pOBInit->BOOTBit1Config);
    }
    
    /* 启动对Flash option bytes的修改 */
    FLASH->CR|=FLASH_CR_OPTSTRT;
    /* EOPIE置位后EOP状态才会置位 */
    FLASH->CR|=FLASH_CR_EOPIE;
    /* 触发正式的写操作 */
    *((__IO uint32_t *)(0x40022080))=0xff;
    /* 等待BSY位被清零 */
    while(FLASH->SR & FLASH_SR_BSY){;}    
    /* 等待EOP拉高，软件清零 */
	while((FLASH->SR & FLASH_SR_EOP)==0){;}
    FLASH->SR = FLASH_SR_EOP;

    /* Process Unlocked */
    __HAL_UNLOCK(&pFlash);

    HAL_FLASH_Lock();
	HAL_FLASH_OB_Lock();
    
    return status;
}
#endif /* HAL_FLASH_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya Semiconductor *****END OF FILE****/
